app/controllers/goals_controller.rb

  def create
    @goal = Goal.new(goal_params)
    @goal.user_id = current_user.id
    if @goal.save
---
INSERT INTO "goals" ("body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["body", "THIS IS MY GOAL!"], ["created_at", "2014-11-04 00:42:51.260822"], ["updated_at", "2014-11-04 00:42:51.260822"], ["user_id", 1]]

  def update
    @goal = Goal.find(params[:id])
    if @goal.update(goal_params)
---
SELECT  "goals".* FROM "goals"  WHERE "goals"."id" = ? LIMIT 1  [["id", 202]]
UPDATE "goals" SET "body" = ?, "updated_at" = ? WHERE "goals"."id" = 203  [["body", "new body"], ["updated_at", "2014-11-04 01:10:58.827546"]]

  def index
    @goals = Goal.where("status = ? OR user_id = ?", "PUBLIC", current_user.id )
---
SELECT "goals".* FROM "goals"  WHERE (status = 'PUBLIC' OR user_id = 1)

  def destroy
    goal = Goal.find(params[:id])
    goal.destroy
---
SELECT  "goals".* FROM "goals"  WHERE "goals"."id" = ? LIMIT 1  [["id", 68]]
DELETE FROM "goals" WHERE "goals"."id" = ?  [["id", 68]]