app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."username" = 'coolcat29' LIMIT 1
---
  def create
    @user = User.find_by_credentials(
      params[:user][:username],
      params[:user][:password]
    )

    if @user
      sign_in!(@user)
      redirect_to goals_url
    else
      user = User.find_by(username:  params[:user][:username])